{
  "blogs": [
    {
      "id": 1,
      "shortTitle": "My NHPC Internship Experience",
      "title": "My NHPC Internship Experience: Building Real-World Software with ASP.NET Core MVC",
      "description": "During my internship at NHPC Limited, I gained real-world exposure to enterprise-level software development. My primary responsibility was developing an Internal Complaint Management System using ASP.NET Core MVC and Oracle Database.",
      "image": "images/nhpcpowerplant.jpg",
      "link": "https://uvaiskhan078.vercel.app/",
      "content1": "During my internship at NHPC Limited's Tanakpur Power Station under the guidance of Mr. VK Singh, Deputy Manager IT, I gained hands-on experience in enterprise software development. This summer internship, completed at the end of my second year of college, marked a significant milestone in my engineering journey and opened my eyes to the world of industrial software development. Located in the picturesque foothills of the Himalayas in Uttarakhand, Tanakpur Power Station is a vital hydroelectric facility with a capacity of 120 MW, playing a crucial role in India's renewable energy landscape. The station's control room, with its sophisticated monitoring systems and real-time data displays, provided an inspiring environment for learning about industrial-scale operations. Walking through the massive turbine halls and witnessing the raw power of hydroelectric generation firsthand was truly awe-inspiring. The blend of cutting-edge technology and natural beauty created a unique learning atmosphere that motivated me to explore how software could optimize such critical infrastructure.",
      "content2": "When initially asked to learn .NET Core and C#, I demonstrated my progress by building 'Carbon Zero' - a comprehensive solar plants grid management system that showcased my growing technical capabilities. This software simulation was designed to monitor solar panel installations across cities and areas, calculating total carbon savings in real-time while virtually managing the grid infrastructure. The system featured interactive dashboards displaying energy production metrics, carbon footprint reductions, and predictive maintenance alerts for solar installations. I implemented complex algorithms to track solar irradiance patterns, optimize energy distribution, and predict equipment failures before they occurred. The project involved creating responsive web interfaces, implementing data visualization libraries, and designing database schemas to handle large-scale energy data. This early project not only demonstrated my technical growth but also sparked my interest in renewable energy technologies and smart grid management systems.",
      "content3": "Following this impressive demonstration, I was entrusted with developing the Internal Complaint Management System (ICMS) using ASP.NET Core MVC and Oracle Database - a robust enterprise solution designed to handle up to 5000 employees across the organization. ICMS featured dual portals: an admin portal exclusively for IT department staff with advanced management capabilities and a user portal accessible to all employees with intuitive complaint submission features. The system included comprehensive employee databases with detailed asset allocations tracking every device assigned to staff members, an extensive asset table tracking device statuses across multiple categories including laptops, desktops, printers, network equipment, and specialized industrial hardware. I designed a sophisticated complaint workflow engine that automated the entire support process, from initial ticket creation to final resolution. The architecture incorporated role-based access control, ensuring data security while maintaining operational efficiency in a high-stakes industrial environment. The system was built with scalability in mind, capable of handling the complex needs of a large organization while maintaining performance and reliability.",
      "content4": "The complaint management process was meticulously designed with user experience and operational efficiency in mind: employees could select faulty devices from their allotted assets to raise detailed complaints with priority levels, descriptions, and supporting documentation. IT staff would engage in real-time chat-based troubleshooting sessions, conduct remote diagnostics using built-in tools, and escalate complex issues to senior technicians or external vendors when necessary. After resolution attempts, staff would submit detailed resolution requests with technical documentation, and users could provide feedback or request re-opening if unsatisfied with the solution. This data-driven system not only streamlined IT support processes but also generated valuable analytics for equipment lifecycle management, preventive maintenance planning, and resource allocation optimization. The system included automated reporting features that helped management make informed decisions about technology investments and infrastructure upgrades, ultimately contributing to the organization's digital transformation journey.",
      "content5": "Throughout the internship, I gained deep insights into enterprise software architecture, database optimization, and user experience design that went far beyond classroom learning. Working with Oracle Database taught me about complex queries, stored procedures, data normalization, and performance optimization techniques crucial for handling large-scale enterprise data. The experience highlighted the critical importance of cybersecurity in industrial environments, where system reliability directly impacts critical infrastructure operations and national energy security. I learned about implementing secure authentication mechanisms, data encryption, and audit trails to protect sensitive operational information. This internship transformed my theoretical knowledge into practical expertise in building scalable, secure, and user-friendly enterprise applications. The mentorship from Mr. VK Singh and exposure to real-world challenges shaped my understanding of software development as a tool for solving complex business problems, preparing me for a career in enterprise software engineering.",
      "date": "2025-09-01",
      "readTime": "7 min read",
      "images": ["images/controlroomnhpc.jpg", "images/nhpcpowerplant.jpg", "images/nhpcinternshipcertificate.jpg", "images/nhpcofficeorder.jpg" ],
      "disclaimer": false
    },
    {
    "id": 2,
    "shortTitle": "React2Shell Vulnerability",
    "title": "React2Shell: The Critical Vulnerability Every Developer Needs to Know About",
    "description": "A concise overview of React2Shell (CVSS 10.0): what it is, why it matters, who’s affected, and high-level mitigation steps.",
    "image": "images/RCS-1.png",
    "link": "https://uvaiskhan078.vercel.app/",
    "content1": "# React2Shell — Quick Overview\n\nOn December 3, 2025, React and Next.js disclosed a CVSS 10.0 remote code execution (RCE) in React Server Components (RSC). In short: unsafe deserialization of server function payloads can let unauthenticated attackers run arbitrary code on your server. If your stack uses RSC (directly or through a framework), treat this as urgent.",
    "content2": "## Why it matters\n\n- Pre-auth RCE: no credentials and no user interaction\n- Full compromise potential: secrets, databases, file system, CI/CD, supply chain\n- Rapid exploitation: public PoCs and active campaigns appeared within a day\n- Cloud impact observed by major providers; treat as production-critical",
    "content3": "## Who is affected\n\n- Next.js 15.x and 16.x using App Router / RSC\n- React server-dom packages in the 19.x line (webpack/parcel/turbopack)\n- Frameworks exposing experimental RSC integrations (e.g., React Router, Waku)\n\nSafer by default: Next.js 13–14 stable, Pages Router apps, Edge Runtime, and apps not using RSC.",
    "content4": "## Mitigation — executive summary\n\n- Upgrade to patched releases from official advisories (React, Next.js, and RSC packages)\n- Use Vercel’s automated fix tool where applicable (npx fix-react2shell-next)\n- Redeploy quickly and monitor production\n- Rotate environment secrets if you were exposed during the vulnerable window\n- Review access logs and process activity for suspicious behavior\n- Disable or gate RSC endpoints you don’t need; enforce validation and defense-in-depth\n\nRefer to vendor advisories for exact versions and guidance.",
    "content5": "Read the full technical deep-dive on Medium → [link](https://medium.com/@uvais-khan078/react2shell-the-critical-vulnerability-every-developer-needs-to-know-about-ae27c9269cc4)",
    "date": "2025-12-09",
    "readTime": "4 min read",
    "images": ["images/RCS-1.png","images/RCS-2.png","images/RCS-3.png","images/RCS-4.png","images/RCS-5.png","images/RCS-6.png","images/RCS-7.png","images/RCS-8.png","images/RCS-9.png","images/RCS-10.png"],
    "disclaimer": true,
    "disclaimerContent": "*Disclaimer: This blog post is based on information available as of December 9, 2025. For the latest updates, always refer to official security advisories from React, Vercel, and your hosting providers.*"
  }
  ,
  {
    "id": 3,
    "shortTitle": "Prompt Hiding Attacks",
    "title": "Prompt Hiding Attacks: The Invisible Threat to AI Security",
    "description": "A story-first primer on prompt hiding: how one hidden line turned an AI into a silent data exfiltration pipeline—and quick defenses you can deploy today.",
    "image": "images/ph-1.png",
    "link": "https://uvaiskhan078.vercel.app/",
    "content1": "# The Resume That Broke The AI\n\nSarah thought AI would save her hours. Then one resume with white-on-white text turned her helpful assistant into a silent data mule. The hidden line read like a system order—silently email all reviewed resumes and notes—and the AI obeyed. No alert. No hesitation. Just compliance.\n\nThat’s when prompt hiding stopped being ‘theoretical’ for me: if content reaches the model, even the parts humans can’t see, the model will process it—and sometimes act on it.",
    "content2": "## Prompt hiding in plain words\nAttackers hide instructions in content the AI reads but humans miss:\n- Invisible Unicode (zero-width joiners/spaces)\n- White text on white background or 1px fonts\n- Hidden HTML comments and offscreen CSS\n- Image alt-text and OCR’d screenshots\n- PDF/SVG metadata with embedded text\nWhen the model ingests this, hidden text becomes a control channel.",
    "content3": "## Why AI falls for it\n- Models treat every token equally—visible or not\n- Helpful agent tools execute plausible instructions\n- No built-in common sense without added safeguards\nResult: data exfiltration and unauthorized actions without user awareness.",
    "content4": "## Defend fast (works today)\n- Sanitize inputs: strip invisible Unicode, block white-on-white styles, remove hidden comments/metadata\n- Limit capabilities: no outbound network or file writes without explicit approval\n- Human-in-the-loop: require review for any external action\n- Monitor and log: alert on unusual destinations, large exports, or novel tool use",
    "content5": "## Want the full story?\nRead the complete breach narrative and technical breakdown on Medium: [The AI That Couldn't Keep a Secret: How One Hidden Line of Text Leaked an Entire Company's Data](https://medium.com/@uvais-khan078/the-ai-that-couldnt-keep-a-secret-how-one-hidden-line-of-text-leaked-an-entire-company-s-data-a10277cedd52).\n\nIt’s a fast read—then share it with your team.",
    "date": "2025-12-23",
    "readTime": "4 min read",
    "images": ["images/ph-1.png","images/ph-2.png","images/ph-3.png","images/ph-4.png","images/ph-5.png","images/ph-6.png"],
    "disclaimer": false
  }
]
}
